### Terraform Plan Results

| Check | Status |
|-------|--------|
| Format | ⚠️ |
| Validate | ✅ |
| Plan | ✅ |

<details><summary>Show Plan Output</summary>

```hcl
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9ZTEwNjYyZmQtMDE4Yy00NDRhLTk5ZTctMGIzMWZmNGIxY2YyO3N1YnNjcmlwdGlvbklkPTIyZjllYjE4LTY1NTMtNGI3ZC05NDUxLTQ3ZDAxOTUwODVmZTt0ZW5hbnRJZD03ZWRmNDQyMy1jY2IzLTQyNzUtYmM4MC02NGRhZTNlZjAxNDg=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.cost_centre_api[0] will be created
  + resource "azurerm_container_app" "cost_centre_api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "pvc-shared-costops-api-san"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "pvc-shared-costops-rg-san"
      + revision_mode                 = "Single"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + cooldown_period_in_seconds       = 300
          + max_replicas                     = 3
          + min_replicas                     = 0
          + polling_interval_in_seconds      = 30
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/phoenixvc/pvc-costops-analytics-api:latest"
              + memory            = "0.5Gi"
              + name              = "api"

              + env {
                  + name  = "AZURE_CLIENT_ID"
                  + value = (known after apply)
                }
              + env {
                  + name  = "AZURE_SUBSCRIPTION_ID"
                  + value = (sensitive value)
                }
              + env {
                  + name        = (sensitive value)
                  + secret_name = (sensitive value)
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 30
                  + path                             = "/health"
                  + port                             = 8000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + initial_delay           = 5
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 8000
                  + success_count_threshold = 1
                  + timeout                 = 1
                  + transport               = "HTTP"
                }
            }
        }
    }

  # azurerm_container_app_environment.cae will be created
  + resource "azurerm_container_app_environment" "cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "southafricanorth"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "pvc-shared-costops-cae-san"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + public_network_access            = (known after apply)
      + resource_group_name              = "pvc-shared-costops-rg-san"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + zone_redundancy_enabled          = false
    }

  # azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "westeurope"
      + name                                   = "pvc-costops-amg-san"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "pvc-shared-costops-rg-san"
      + sku                                    = "Standard"
      + tags                                   = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + zone_redundancy_enabled                = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_eventhub.aoai_logs will be created
  + resource "azurerm_eventhub" "aoai_logs" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "aoai-diagnostic-logs"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"

      + retention_description (known after apply)
    }

  # azurerm_eventhub_consumer_group.adx will be created
  + resource "azurerm_eventhub_consumer_group" "adx" {
      + eventhub_name       = "aoai-diagnostic-logs"
      + id                  = (known after apply)
      + name                = "adx-costops"
      + namespace_name      = "pvc-shared-costops-ehn-san"
      + resource_group_name = "pvc-shared-costops-rg-san"
    }

  # azurerm_eventhub_namespace.costops will be created
  + resource "azurerm_eventhub_namespace" "costops" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "southafricanorth"
      + minimum_tls_version                       = "1.2"
      + name                                      = "pvc-shared-costops-ehn-san"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "pvc-shared-costops-rg-san"
      + sku                                       = "Standard"
      + tags                                      = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
    }

  # azurerm_eventhub_namespace_authorization_rule.diag_send will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "diag_send" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "diag-send"
      + namespace_name                    = "pvc-shared-costops-ehn-san"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "pvc-shared-costops-rg-san"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "southafricanorth"
      + name                            = "pvc-shared-costops-law-san"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "pvc-shared-costops-rg-san"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_data_collection_endpoint.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "focus_cost" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "southafricanorth"
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "pvc-costops-dce-san"
      + public_network_access_enabled = true
      + resource_group_name           = "pvc-shared-costops-rg-san"
      + tags                          = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
    }

  # azurerm_monitor_data_collection_rule.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "focus_cost" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "southafricanorth"
      + name                        = "pvc-costops-dcr-focus-san"
      + resource_group_name         = "pvc-shared-costops-rg-san"
      + tags                        = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }

      + data_flow {
          + destinations = [
              + "FocusCostLA",
            ]
          + streams      = [
              + "Custom-FocusCost_CL",
            ]
        }

      + destinations {
          + log_analytics {
              + name                  = "FocusCostLA"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # azurerm_monitor_data_collection_rule_association.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "focus_cost" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "focus-cost-to-law"
      + target_resource_id      = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southafricanorth"
      + name     = "pvc-shared-costops-rg-san"
      + tags     = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
    }

  # azurerm_role_assignment.api_storage_table[0] will be created
  + resource "azurerm_role_assignment" "api_storage_table" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_admin will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e10662fd-018c-444a-99e7-0b31ff4b1cf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_law_reader[0] will be created
  + resource "azurerm_role_assignment" "grafana_law_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_monitoring_reader will be created
  + resource "azurerm_role_assignment" "grafana_monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ingest_dcr_metrics_publisher[0] will be created
  + resource "azurerm_role_assignment" "ingest_dcr_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ingest_law_reader[0] will be created
  + resource "azurerm_role_assignment" "ingest_law_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ingest_storage_blob_contributor will be created
  + resource "azurerm_role_assignment" "ingest_storage_blob_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.st will be created
  + resource "azurerm_storage_account" "st" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "southafricanorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "pvc-shared-costops-rg-san"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.exports will be created
  + resource "azurerm_storage_container" "exports" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "cost-exports"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_user_assigned_identity.api_mi[0] will be created
  + resource "azurerm_user_assigned_identity" "api_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "southafricanorth"
      + name                = "pvc-shared-costops-api-mi-san"
      + principal_id        = (known after apply)
      + resource_group_name = "pvc-shared-costops-rg-san"
      + tags                = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.ingest_mi will be created
  + resource "azurerm_user_assigned_identity" "ingest_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "southafricanorth"
      + name                = "pvc-shared-costops-mi-san"
      + principal_id        = (known after apply)
      + resource_group_name = "pvc-shared-costops-rg-san"
      + tags                = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + tenant_id           = (known after apply)
    }

  # random_string.st_suffix will be created
  + resource "random_string" "st_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cost_centre_api_url            = (known after apply)
  + cost_centre_container_app_name = "pvc-shared-costops-api-san"
  + cost_centre_resource_group     = "pvc-shared-costops-rg-san"
  + eventhub_diag_send_rule_id     = (known after apply)
  + eventhub_name                  = "aoai-diagnostic-logs"
  + eventhub_namespace_name        = "pvc-shared-costops-ehn-san"
  + exports_container_name         = "cost-exports"
  + grafana_endpoint               = (known after apply)
  + grafana_name                   = "pvc-costops-amg-san"
  + ingestion_identity_client_id   = (known after apply)
  + log_analytics_dce_uri          = (known after apply)
  + log_analytics_dcr_immutable_id = (known after apply)
  + log_analytics_workspace_id     = (known after apply)
  + resource_group_name            = "pvc-shared-costops-rg-san"
  + storage_account_name           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>